Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/after_your_baby_is_born/postnatal_care_for_your_baby.html.txt.tmx
Source language: en
Languages: ga

source: Postnatal care for your baby
ga: Cúram iarbhreithe do do naíonán

source: Under the Maternity and Infant Care Scheme (the scheme that provides free antenatal and postnatal care), mother and baby are entitled to two visits to your family doctor (GP) after the baby is born. The first visit is when the baby is 2 weeks old, and the second is at 6 weeks
ga: Faoin Scéim Cúram Máithreachais agus Naíonán (an scéim a chuireann cúram réamhbhreithe agus iarbhreithe saor in aisce ar fáil), tá an mháthair agus an naíonán i dteideal 2 chuairt ar do dhochtúir teaghlaigh tar éis bhreith an linbh - cuairt amháin nuair a bhíonn an leanbh 2 sheachtain d'aois, agus ceann eile nuair a bhíonn an leanbh 6 seachtaine d'aois

source: The visit at 2 weeks is primarily to re-establish contact with your GP and to see how the mother and baby are getting on
ga: Is ann don chuairt ag 2 sheachtain go bunúsach le teagmháil a athbhunú le do dhochtúir teaghlaigh agus féachaint mar atá ag éirí leis an máthair agus an naíonán

source: The more widely known visit is referred to as the "6-week check"
ga: Is í an chúirt is mó a bhfuil eolas uirthi ná an "seiceáil 6 seachtaine"

source: You can either go to your GP or your maternity hospital for this. The GP or the hospital paediatrician will examine your baby to check his/her development
ga: Is féidir leat dul chuig do dhochtúir teaghlaigh nó chuig d'ospidéal máithreachais lena haghaidh sin

source: They will check the baby's weight, length, head circumference and hips
ga: Scrúdóidh an dochtúir teaghlaigh nó an leanbhlia do naíonán lena f(h)orbairt a sheiceáil, ag féachaint ar mheáchan do naíonáin, a f(h)ad, imlíne an chinn agus na cromáin

source: They will discuss the baby's feeding patterns and general health with you, and address any concerns you might have
ga: Pléifidh sé/sí patrúin cothaithe agus sláinte ginearálta an naíonáin leat agus tabharfaidh sé/sí aghaidh ar aon imní a d'fhéadfadh a bheith ort

source: Thereafter, your points of contact with the healthcare system will be via your GP, who will immunise your baby, and your public health nurse, who will visit you at home
ga: Ina dhiaidh sin, is tríd an dochtúir teaghlaigh a bheidh do phointí teagmhála leis an gcóras cúram sláinte, agus is é/í a imdhíonfaidh do naíonán vaicsíniú do do naíonán, agus tríd an altra sláinte phoiblí cúram máithreachais agus an Altra Sláinte Phoiblí
